"""" 
:البرمجة الموجهة بالأحداث (Event Driven Programming)
 هي نمط من أنماط البرمجة يتم فيه تنفيذ الشفرة استجابةً لحدث معين يحدث في النظام
 عندما يحدث حدث، يتم استدعاء دالة أو طريقة معينة تسمى معالج الحدث
 لتعامل مع هذا الحدث واتخاذ إجراءات محددة

 في برمجة المواقع وتطبيقات سطح المكتب، على سبيل المثال، قد تكون هناك 
 أحداث مختلفة مثل الضغط على زر، أو إدخال بيانات في حقل نص، أو تغيير قيمة 
 في قائمة منسدلة. عند حصول أي من هذه الأحداث، يتم استدعاء معالج الحدث 
 لمرتبط بهذا الحدث للتعامل معه.
 فإذا افترضنا أن لدينا زرًا في صفحة ويب وأراد المستخدم الضغط على هذا الزر، فإن 
 الحدث سيتم تنشيطه وسيتم استدعاء معالج الحدث المرتبط بهذا الزر. يمكن 
 لمعالج الحدث أن يقوم بأي عملية محددة، مثل تغيير نص في صفحة الويب أو إظهار رسالة تنبيه

 الفكرة الأساسية وراء البرمجة الموجهة بالأحداث هي تفادي استخدام حلقات التكرار
 المستمرة للاستماع إلى التغيرات في النظام. بدلاً من ذلك، يتم استخدام
 نظام حدث-استجابة حيث يتم استجابةً للأحداث فقط عند حصولها.

تُستخدَم البرمجة الموجهة بالأحداث في العديد من التطبيقات والأنظمة، مثل 
تطبيقات سطح المكتب، وتطبيقات الويب، والروبوتات، وغيرها.

في بايثون، يتم استخدام مكتبات مثل
 Tkinter و PyQt 
لتطوير تطبيقات قائمة على الأحداث
"""

import tkinter as tk

def button_click():
    print("The button has been clicked!")

window = tk.Tk()

button = tk.Button(window, text="click here", command=button_click)
button.pack()

window.mainloop()

